Revit 2027 API
OverrideGraphicSettings.SetProjectionLineWeight Method
 Sets the projection surface line weight.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OverrideGraphicSettings SetProjectionLineWeight(
	int lineWeight
)
Public Function SetProjectionLineWeight (
	lineWeight As Integer
) As OverrideGraphicSettings
public:
OverrideGraphicSettings^ SetProjectionLineWeight(
	int lineWeight
)
member SetProjectionLineWeight :
        lineWeight : int -> OverrideGraphicSettings
Parameters
lineWeight Int32
 Value of the projection surface line weight for the override. InvalidPenNumber means no override is set.
Return Value
OverrideGraphicSettings
 Reference to the changed object.
Exceptions
Exception | Condition
ArgumentException |  Line weight must be a positive integer less than 17 or invalidPenNumber.
See Also
Reference
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace